uliano/brio/brio/stm32g0/device_tables.hpp
/// Is WKUPn (n = 1..6) bonded on this part?
constexpr bool pwr_wakeup_pin_present(uint8_t n) {
    return n >= 1u && n <= 6u &&
           (pwr_wakeup_pin_mask & (1u << (n - 1u))) != 0u;
}

/// How many of them there are (for a sweep that must not walk past the
/// end of the part).
constexpr uint8_t pwr_wakeup_pin_count() {
    uint8_t n = 0;
    for (uint8_t i = 1; i <= 6u; ++i) {
        if (pwr_wakeup_pin_present(i)) {
            ++n;
        }
    }
    return n;
}

/// PWR_PUCRx for port `letter`, null where the part has no such
/// register. A POINTER and not a mask, because these are struct members
/// and the absent ones cannot be named at all (4.4.8 and its
/// neighbours: x = A, B, C, D, E, F, with E the G0B1/G0C1's alone).
inline volatile uint32_t* pwr_pullup_reg(char letter) {
    switch (letter) {
#if defined(GPIOA_BASE)
        case 'A': return &PWR->PUCRA;
#endif
#if defined(GPIOB_BASE)
        case 'B': return &PWR->PUCRB;
#endif
#if defined(GPIOC_BASE)
        case 'C': return &PWR->PUCRC;
#endif
#if defined(GPIOD_BASE)
        case 'D': return &PWR->PUCRD;
#endif
#if defined(GPIOE_BASE)
        case 'E': return &PWR->PUCRE;
#endif
#if defined(GPIOF_BASE)
        case 'F': return &PWR->PUCRF;
#endif
        default: return nullptr;
    }
}

/// PWR_PDCRx for port `letter`, null where absent.
inline volatile uint32_t* pwr_pulldown_reg(char letter) {
    switch (letter) {
#if defined(GPIOA_BASE)
        case 'A': return &PWR->PDCRA;
#endif
#if defined(GPIOB_BASE)
        case 'B': return &PWR->PDCRB;
#endif
#if defined(GPIOC_BASE)
        case 'C': return &PWR->PDCRC;
#endif
#if defined(GPIOD_BASE)
        case 'D': return &PWR->PDCRD;
#endif
#if defined(GPIOE_BASE)
        case 'E': return &PWR->PDCRE;
#endif
#if defined(GPIOF_BASE)
        case 'F': return &PWR->PDCRF;
#endif
        default: return nullptr;
    }
}

/// Does this part carry the second I/O supply, and with it PWR_CR2's
/// VDDIO2 monitor and PWR_SR2's flag for it (4.4.2, note on
/// PVM_VDDIO2)?
constexpr bool pwr_vddio2_present() {
#if defined(PWR_CR2_PVM_VDDIO2)
    return true;
#else
    return false;
#endif
}

/// The EXTI lines the RTC and the TAMP raise (table 65: 19 and 21, both
/// DIRECT - no trigger selection and no pending bit in the EXTI). The
/// NUMBERS are the manual's, like comp_exti_line()'s, which is why they
/// live here.
constexpr uint8_t rtc_exti_line = 19;
constexpr uint8_t tamp_exti_line = 21;

/// The vector both of them arrive on (table 61: one line for the whole
/// RTC domain).
constexpr IRQn_Type rtc_irq() { return RTC_TAMP_IRQn; }

/// How many TAMP backup registers this part implements: BKP0R..BKP4R on
/// every G0, counted off the struct rather than asserted.
constexpr uint8_t tamp_backup_registers() {
    return static_cast<uint8_t>(
        (sizeof(TAMP_TypeDef) - offsetof(TAMP_TypeDef, BKP0R)) /
        sizeof(uint32_t));
}

} // namespace brio
